sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
/******************************************************************************
 * Function
 *****************************************************************************/
bleGapMem *bleGetGapMem(void)
{
  return &gapMem;
}

int BLE_GapGetDeviceConfig(BLE_GapDeviceConfig *deviceConfig)
{
  int type = 0;
  int ret = BLE_SUCCESS;

  if((deviceConfig == NULL) || (deviceConfig->data == NULL)) {
    return -EINVAL;
  }

  type = deviceConfig->type;
  switch( type ) {
  case BLE_GAP_DEVICE_CONFIG_ADDR:
    ret = getAddress((BLE_GapAddr *)deviceConfig->data);
    break;
  case BLE_GAP_DEVICE_CONFIG_NAME:
    ret = getName((BLE_GapName *)deviceConfig->data);
    break;
  default:
    ret = -EINVAL;
    break;
  }
  return ret;
}

int BLE_GapSetDeviceConfig(BLE_GapDeviceConfig *deviceConfig)
{
  int type = 0;
  int ret = BLE_SUCCESS;

  if((deviceConfig == NULL)  || (deviceConfig->data == NULL)) {
    return -EINVAL;
  }

  type = deviceConfig->type;
  switch( type ) {
  case BLE_GAP_DEVICE_CONFIG_ADDR:
    ret = setAddress((BLE_GapAddr *)deviceConfig->data);
    break;
  case BLE_GAP_DEVICE_CONFIG_NAME:
    ret = setName((BLE_GapName *)deviceConfig->data);
    break;
  case BLE_GAP_DEVICE_CONFIG_UUID:
    ret = setCustomBaseuuid((uint8_t *)deviceConfig->data);
    break;
  case BLE_GAP_DEVICE_CONFIG_SERV_CHNG_ENABLE:
    /* TODO */
    break;
  case BLE_GAP_DEVICE_CONFIG_APPR_VALUE:
    /* TODO */
    break;
  case BLE_GAP_DEVICE_CONFIG_PPCP_VALUE:
    /* TODO */
    break;
  default:
    ret = -EINVAL;
    break;
  }
  return ret;
}

int BLE_GapSetAdvData(BLE_GapAdvData *advData)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;
  uint8_t index = 0;
  uint8_t advLen = 0;
  uint8_t *data = NULL;

  if(advData == NULL) {
    return -EINVAL;
  }

  if(advData->flags != 0) {
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_FLAGS_SIZE;
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_FLAGS;
    gapMem.gapAdvData[index++] = advData->flags;
  }
  if(advData->complete16Uuid != 0) {
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_16_UUIDS_SIZE;
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_16_UUIDS;
    gapMem.gapAdvData[index++] = (uint8_t)(advData->complete16Uuid >> 0);
    gapMem.gapAdvData[index++] = (uint8_t)(advData->complete16Uuid >> 8);
  }
  if(advData->complete32Uuid != 0) {
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_32_UUIDS_SIZE;
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_32_UUIDS;
    gapMem.gapAdvData[index++] = (uint8_t)(advData->complete32Uuid >> 0);
    gapMem.gapAdvData[index++] = (uint8_t)(advData->complete32Uuid >> 8);
    gapMem.gapAdvData[index++] = (uint8_t)(advData->complete32Uuid >> 16);
    gapMem.gapAdvData[index++] = (uint8_t)(advData->complete32Uuid >> 24);
  }
  if(advData->complete128Uuid != 0) {
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_128_UUIDS_SIZE;
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_128_UUIDS;
    memcpy(&gapMem.gapAdvData[index], advData->complete128Uuid, 16);
    index += 16;
  }
  advLen = advData->completeLocalName.advLength;
  data = advData->completeLocalName.advData;
  if((advLen != 0)&&(data != NULL)) {
    gapMem.gapAdvData[index++] = advLen+1;
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_COMPLETE_LOCAL_NAME;
    memcpy(&gapMem.gapAdvData[index], data, advLen);
    index += advLen;
  }
  advLen = advData->manufacturerSpecificData.advLength;
  data = advData->manufacturerSpecificData.advData;
  if((advLen != 0)&&(data != NULL)) {
    gapMem.gapAdvData[index++] = advLen+1;
    gapMem.gapAdvData[index++] = ADV_DATA_TYPE_MANUFACTURER_SPECIFIC_DATA;
    memcpy(&gapMem.gapAdvData[index], data, advLen);
    index += advLen;
  }
  if ((advData->serviceDataCount != 0) && (advData->serviceData != NULL)) {
    int i;

    for (i = 0; i < advData->serviceDataCount; i++) {
      BLE_GapAdvStructure *pServiceData = &(advData->serviceData[i]);

      advLen = pServiceData->advLength;
      data = pServiceData->advData;
      if ((advLen != 0) && (data != NULL)) {
        gapMem.gapAdvData[index++] = advLen + 1;
        gapMem.gapAdvData[index++] = ADV_DATA_TYPE_SERVICE_DATA;
        memcpy(&gapMem.gapAdvData[index], data, advLen);
        index += advLen;
      }
    }
  }
  gapMem.gapAdvLen = index+1;
  if(gapMem.gapAdvLen > BLE_GAP_ADV_MAX_SIZE) {
    return -EINVAL;
  }
#if NRF_SD_BLE_API_VERSION > 5
  // Configure a initial advertising configuration. The advertising data and and advertising
  // parameters will be changed later when we call @ref ble_advertising_start, but must be set
  // to legal values here to define an advertising handle.
  ble_gap_adv_params_t advParams = {0};
  advParams.primary_phy     = BLE_GAP_PHY_1MBPS;
  advParams.duration        = ADV_DEFAULT_TIMEOUT;
  advParams.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  advParams.p_peer_addr     = NULL;
  advParams.filter_policy   = BLE_GAP_ADV_FP_ANY;
  advParams.interval        = ADV_DEFAULT_INTERVAL;
  errCode = sd_ble_gap_adv_set_configure(&gapMem.advHandle, NULL, &advParams);
  if (errCode) {
    BLE_PRT("BLE_GapSetAdvData:sd_ble_gap_adv_set_configure fail 0x%x\n", errCode);
    goto end;
  }
  errCode = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, gapMem.advHandle, advData->txPower);
  if (errCode) {
    BLE_PRT("BLE_GapStartAdv:sd_ble_gap_tx_power_set fail 0x%x\n", errCode);
  }
end:
#else
  errCode = sd_ble_gap_adv_data_set(gapMem.gapAdvData, gapMem.gapAdvLen, NULL, 0);
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);

  return ret;
}

int BLE_GapStartAdvExt(BLE_GapAdvParams *advParams)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;

#if NRF_SD_BLE_API_VERSION > 5
  if (!((advParams->primary_phy == BLE_GAP_PHY_1MBPS) || (advParams->primary_phy == BLE_GAP_PHY_CODED))) {
    return -EINVAL;
  }

  ble_gap_adv_data_t advData = {0};
  advData.adv_data.p_data = gapMem.gapAdvData;
  advData.adv_data.len    = gapMem.gapAdvLen;

  ble_gap_adv_params_t params = {0};
  params.interval = advParams->interval;
  params.duration = advParams->duration;
  params.primary_phy = advParams->primary_phy;
  params.secondary_phy = advParams->primary_phy;
  params.p_peer_addr     = NULL;
  params.filter_policy   = BLE_GAP_ADV_FP_ANY;
  if (params.primary_phy == BLE_GAP_PHY_1MBPS) {
    params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  }
  else {
    params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
  }

