sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
  errCode = sd_ble_gap_adv_set_configure(&gapMem.advHandle, &advData, &params);
  if (errCode) {
    BLE_PRT("BLE_GapStartAdv:sd_ble_gap_adv_set_configure fail 0x%x\n", errCode);
    goto end;
  }
  errCode = sd_ble_gap_adv_start(gapMem.advHandle, APP_BLE_CONN_CFG_TAG);
end:
#else
  errCode = NRF_ERROR_NOT_SUPPORTED;
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);

  return ret;
}

int BLE_GapStartAdv(void)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;
  ble_gap_adv_params_t advParams = {0};

#if NRF_SD_BLE_API_VERSION > 5
  ble_gap_adv_data_t advData = {0};
  advData.adv_data.p_data = gapMem.gapAdvData;
  advData.adv_data.len    = gapMem.gapAdvLen;

  advParams.primary_phy     = BLE_GAP_PHY_1MBPS;
  advParams.duration        = ADV_DEFAULT_TIMEOUT;
  advParams.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
  advParams.p_peer_addr     = NULL;
  advParams.filter_policy   = BLE_GAP_ADV_FP_ANY;
  advParams.interval        = ADV_DEFAULT_INTERVAL;
  errCode = sd_ble_gap_adv_set_configure(&gapMem.advHandle, &advData, &advParams);
  if (errCode) {
    BLE_PRT("BLE_GapStartAdv:sd_ble_gap_adv_set_configure fail 0x%x\n", errCode);
    goto end;
  }
  errCode = sd_ble_gap_adv_start(gapMem.advHandle, APP_BLE_CONN_CFG_TAG);
end:
#else
  advParams.type = BLE_GAP_ADV_TYPE_ADV_IND;
  advParams.p_peer_addr = NULL;
  advParams.fp = BLE_GAP_ADV_FP_ANY;
  advParams.interval = ADV_DEFAULT_INTERVAL;
  advParams.timeout = ADV_DEFAULT_TIMEOUT;
  errCode = sd_ble_gap_adv_start(&advParams, APP_BLE_CONN_CFG_TAG);
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);

  return ret;
}

int BLE_GapStopAdv(void)
{
  int errCode = BLE_SUCCESS;
#if NRF_SD_BLE_API_VERSION > 5
  // arg is tentative.
  errCode = sd_ble_gap_adv_stop(gapMem.advHandle);
#else
  errCode = sd_ble_gap_adv_stop();
#endif
  return bleConvertErrorCode((uint32_t)errCode);
}

int BLE_GapSetSecParam(BLE_GapSecCfg *param)
{
  int errCode  = 0;
  int ret      = BLE_SUCCESS;
  BLE_GapSecCfgPasskey *pkey = NULL;
  ble_opt_t    bleOpt = {0};

  if((param == NULL) || (param->data == NULL))
    {
      return -EINVAL;
    }
  memset(&bleOpt,0x00,sizeof(bleOpt));
  switch(param->type)
    {
      case SEC_CFG_PASSKEY:
        {
          pkey = (BLE_GapSecCfgPasskey *)param->data;
          bleOpt.gap_opt.passkey.p_passkey = (uint8_t*)(pkey->passkey);
          errCode = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &bleOpt);
          ret = bleConvertErrorCode((uint32_t)errCode);
          break;
        }

      default:
        ret = -EINVAL;
        break;
    }
  return ret;
}

int BLE_GapExchangePairingFeature(BLE_GapConnHandle connHandle, BLE_GapPairingFeature *pairingFeature)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;
  ble_gap_sec_params_t secParams = {0};
  ble_gap_sec_keyset_t keysExchanged = {{0}};
  ble_gap_sec_params_t *p_sec = NULL;

  if(pairingFeature != NULL) {
    if((pairingFeature->oob != BLE_GAP_OOB_AUTH_DATA_PRESENT) &&
       (pairingFeature->oob != BLE_GAP_OOB_AUTH_DATA_NOT_PRESENT)) {
      BLE_PRT("pairingFeature->oob=%d\n", pairingFeature->oob);
      return -EINVAL;
    }
    if((pairingFeature->maxKeySize < pairingFeature->minKeySize) ||
      (pairingFeature->maxKeySize > BLE_GAP_MAX_KEY_SIZE) ||
      (pairingFeature->minKeySize < BLE_GAP_MIN_KEY_SIZE)) {
      BLE_PRT("pairingFeature->maxKeySize=%d, pairingFeature->minKeySize=%d\n", pairingFeature->maxKeySize, pairingFeature->minKeySize);
      return -EINVAL;
    }

    memset(&secParams,0,sizeof(secParams));
    memset(&keysExchanged,0,sizeof(keysExchanged));

    memset(&gapMem.wrapperBondInfo.ownEncKey,0,sizeof(gapMem.wrapperBondInfo.ownEncKey));
    memset(&gapMem.wrapperBondInfo.ownIdKey,0,sizeof(gapMem.wrapperBondInfo.ownIdKey));
    memset(&gapMem.wrapperBondInfo.peerEncKey,0,sizeof(gapMem.wrapperBondInfo.peerEncKey));
    memset(&gapMem.wrapperBondInfo.peerIdKey,0,sizeof(gapMem.wrapperBondInfo.peerIdKey));

    secParams.oob          = pairingFeature->oob;
    secParams.io_caps      = pairingFeature->ioCap;
    secParams.max_key_size = pairingFeature->maxKeySize;
    secParams.min_key_size = pairingFeature->minKeySize;
    secParams.mitm         = (pairingFeature->authReq & BLE_GAP_AUTH_MITM) >> 1;
    secParams.bond         = (pairingFeature->authReq & BLE_GAP_AUTH_BOND) >> 0;

    p_sec = &secParams;
  }

  secParams.kdist_own.enc = 1;
  secParams.kdist_own.id  = 1;
  secParams.kdist_peer.enc  = 1;
  secParams.kdist_peer.id   = 1;

  keysExchanged.keys_own.p_enc_key  = &gapMem.wrapperBondInfo.ownEncKey;
  keysExchanged.keys_own.p_id_key   = &gapMem.wrapperBondInfo.ownIdKey;
  keysExchanged.keys_peer.p_enc_key    = &gapMem.wrapperBondInfo.peerEncKey;
  keysExchanged.keys_peer.p_id_key    = &gapMem.wrapperBondInfo.peerIdKey;

  errCode = sd_ble_gap_sec_params_reply(connHandle, BLE_GAP_SEC_STATUS_SUCCESS, p_sec, &keysExchanged);
  ret = bleConvertErrorCode((uint32_t)errCode);
  memcpy(&gapMem.keySet, &keysExchanged, sizeof(ble_gap_sec_keyset_t));

  // own
  BLE_PRT("ExchangePairing: own id_irk=0x");
  for (int i=0; i<16; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.ownIdKey.id_info.irk[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: own id_addr_type=%d\n", gapMem.wrapperBondInfo.ownIdKey.id_addr_info.addr_type);
  BLE_PRT("ExchangePairing: own id_addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.ownIdKey.id_addr_info.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: own master_id_ediv=%d\n", gapMem.wrapperBondInfo.ownEncKey.master_id.ediv);
  BLE_PRT("ExchangePairing: own master_id_rand=0x");
  for (int i=0; i<8; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.ownEncKey.master_id.rand[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: own enc_info_auth=%d\n", gapMem.wrapperBondInfo.ownEncKey.enc_info.auth);
  if (gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk_len) {
    BLE_PRT("ExchangePairing: own enc_info_ltk=0x");
    for (int i=0; i<gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk_len; i++) {
      BLE_PRT("%02x", gapMem.wrapperBondInfo.ownEncKey.enc_info.ltk[i]);
    }
    BLE_PRT("\n");
  } else {
    BLE_PRT("ExchangePairing: peer enc_info_ltk=%d\n", gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len);
  }

  // peer
  BLE_PRT("ExchangePairing: peer id_irk=0x");
  for (int i=0; i<16; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.peerIdKey.id_info.irk[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: peer id_addr_type=%d\n", gapMem.wrapperBondInfo.peerIdKey.id_addr_info.addr_type);
  BLE_PRT("ExchangePairing: peer id_addr=0x");
  for (int i=0; i<6; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.peerIdKey.id_addr_info.addr[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: peer master_id_ediv=%d\n", gapMem.wrapperBondInfo.peerEncKey.master_id.ediv);
  BLE_PRT("ExchangePairing: peer master_id_rand=0x");
  for (int i=0; i<8; i++) {
    BLE_PRT("%02x", gapMem.wrapperBondInfo.peerEncKey.master_id.rand[i]);
  }
  BLE_PRT("\n");
  BLE_PRT("ExchangePairing: peer enc_info_auth=%d\n", gapMem.wrapperBondInfo.peerEncKey.enc_info.auth);
  if (gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len) {
    BLE_PRT("ExchangePairing: peer enc_info_ltk=0x");
    for (int i=0; i<gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len; i++) {
      BLE_PRT("%02x", gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk[i]);
    }
    BLE_PRT("\n");
  } else {
    BLE_PRT("ExchangePairing: peer enc_info_ltk=%d\n", gapMem.wrapperBondInfo.peerEncKey.enc_info.ltk_len);
  }

  return ret;
}

#if NRF_SD_BLE_API_VERSION > 5
static int8_t ble_gap_scan_tx_power = 0;
uint8_t bleAdvReportBuffer[BLE_GAP_SCAN_BUFFER_EXTENDED_MIN];
#endif

int BLE_GapSetScanParam(BLE_GapScanParams *scanParam)
{
  if(scanParam == NULL) {
    return -EINVAL;
  }
  if (!(scanParam->interval > MAX_SCAN_INTERVAL ||
      scanParam->interval < MIN_SCAN_INTERVAL ||
      scanParam->window > MAX_SCAN_WINDOW ||
      scanParam->window  < MIN_SCAN_WINDOW ||
      scanParam->timeout > MAX_SCAN_TIMEOUT ||
      scanParam->timeout < MIN_SCAN_TIMEOUT)) {
    gapMem.scanParams.active       = scanParam->active;
    //gapMem.scanParams.selective    = 0;
    gapMem.scanParams.interval     = scanParam->interval;
    gapMem.scanParams.window       = scanParam->window;
    //gapMem.scanParams.p_whitelist  = NULL;
    gapMem.scanParams.timeout      = scanParam->timeout;
  }
  else {
    return -EINVAL;
  }
#if NRF_SD_BLE_API_VERSION > 5
  gapMem.scanParams.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
  gapMem.scanParams.scan_phys     = scanParam->scan_phys;
  if (gapMem.scanParams.scan_phys == BLE_GAP_PHY_CODED) {
    gapMem.scanParams.extended    = 1;
  }
  else {
    gapMem.scanParams.extended    = 0;
  }
  ble_gap_scan_tx_power           = scanParam->tx_power;
#endif
  return 0;
}

int BLE_GapStartScan(void)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

  if ((gapMem.scanParams.interval > MAX_SCAN_INTERVAL ||
      gapMem.scanParams.interval < MIN_SCAN_INTERVAL ||
      gapMem.scanParams.window > MAX_SCAN_WINDOW ||
      gapMem.scanParams.window  < MIN_SCAN_WINDOW ||
      gapMem.scanParams.timeout > MAX_SCAN_TIMEOUT ||
      gapMem.scanParams.timeout < MIN_SCAN_TIMEOUT)) {
    // default
    gapMem.scanParams.active       = EXECUTE_ACTIVE_SCAN;
    gapMem.scanParams.interval     = SCAN_INTERVAL;
    gapMem.scanParams.window       = SCAN_WINDOW;
    gapMem.scanParams.timeout      = SCAN_TIMEOUT;
#if NRF_SD_BLE_API_VERSION > 5
    gapMem.scanParams.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
    gapMem.scanParams.scan_phys     = BLE_GAP_PHY_1MBPS;
    gapMem.scanParams.extended      = ENABLE_EXTENDED_ADV_RECV;
    ble_gap_scan_tx_power           = 0;
#endif
  }
#if NRF_SD_BLE_API_VERSION > 5
  errCode = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, 0,
    ble_gap_scan_tx_power);
  if (errCode) {
    BLE_PRT("sd_ble_gap_tx_power_set fail 0x%x\n", errCode);
    goto end;
  }

  ble_data_t reportBuf = {0};
  reportBuf.p_data = bleAdvReportBuffer;
  reportBuf.len = BLE_GAP_SCAN_BUFFER_EXTENDED_MIN;
  errCode = sd_ble_gap_scan_start(&gapMem.scanParams, &reportBuf);
end:
#else
  errCode = sd_ble_gap_scan_start(&gapMem.scanParams);
#endif
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

int BLE_GapStartScanExt(BLE_GapScanParams *scanparams)
{
  int ret      = BLE_SUCCESS;
  int errCode  = 0;

