sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_gap.c
int BLE_GapGetBondInfoIdList(BLE_GapBondInfoList *bondInfo)
{
  uint32_t list = bleBondEnableList;

  if (bondInfo == NULL)
    {
      return -EINVAL;
    }

  bondInfo->bondNum = 0;
  for(int index = 0; index < BLE_SAVE_BOND_DEVICE_MAX_NUM; index++, list >>= 1)
    {
      if (list & 1)
        {
          BLE_PRT("BLE_GapGetBondInfoIdList: exist index %d\n", index);
          memcpy(bondInfo->bondInfoId[bondInfo->bondNum],
          BondInfoInFlash[index].bondInfo.addr, BLE_GAP_ADDR_LENGTH);
          bondInfo->bondNum++;
         }
    }
  return 0;
}

int BLE_GapEncrypt(uint16_t handle, ble_gap_enc_key_t *key)
{
  int errCode;

  errCode = sd_ble_gap_encrypt(handle, &key->master_id, &key->enc_info);
  return bleConvertErrorCode((uint32_t)errCode);
}

int BLE_GapStartRssi(BLE_GapConnHandle connHandle, uint8_t thresholdDbm, uint8_t skipCount)
{
  int ret     = BLE_SUCCESS;
  int errCode = 0;

  errCode = sd_ble_gap_rssi_start(connHandle, thresholdDbm, skipCount);
  ret = bleConvertErrorCode((uint32_t)errCode);
  if (ret == BLE_SUCCESS) {
    gapMem.startRssi = true;
  }
  return ret;
}

int BLE_GapStopRssi(BLE_GapConnHandle connHandle)
{
  int ret     = BLE_SUCCESS;
  int errCode = 0;

  errCode = sd_ble_gap_rssi_stop(connHandle);
  ret = bleConvertErrorCode((uint32_t)errCode);
  if (ret == BLE_SUCCESS) {
    gapMem.startRssi = false;
  }
  return ret;
}

int BLE_GapGetRssi(BLE_GapConnHandle connHandle, int8_t *rssi)
{
  int ret = BLE_SUCCESS;

  if (rssi == NULL) {
    return -EINVAL;
  }
  if (gapMem.peerRssi == 0) {
    return -EPERM;
  }
  if (gapMem.startRssi == false) {
    return -EINVAL;
  }
  *rssi = gapMem.peerRssi;
  return ret;
}

int BLE_GapPhyUpdate(BLE_GapConnHandle connHandle, BLE_GapPhys *gapPhys)
{
  int ret = 0;

  if(gapPhys == NULL) {
    return -EINVAL;
  }

  ble_gap_phys_t phys;
  phys.tx_phys = gapPhys->txPhy;
  phys.rx_phys = gapPhys->rxPhy;
  ret = sd_ble_gap_phy_update(connHandle, &phys);
  return bleConvertErrorCode((uint32_t)ret);
}

static
int getAddress(BLE_GapAddr *addr)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;
  ble_gap_addr_t bleGapAddr = {0};

  if(addr == NULL) {
    return -EINVAL;
  }

  errCode = sd_ble_gap_addr_get(&bleGapAddr);
  ret = bleConvertErrorCode((uint32_t)errCode);
  memcpy(addr->addr, bleGapAddr.addr, BLE_GAP_ADDR_LENGTH);

  return ret;
}

static
int setAddress(BLE_GapAddr *addr)
{
  int errCode = 0, ret = 0;
  ble_gap_addr_t bleGapAddr = {0};
  ble_gap_privacy_params_t privacy = {0};

  if(addr == NULL) {
    return -EINVAL;
  }
  switch( addr->type ) {
  case BLE_GAP_ADDR_TYPE_PUBLIC:
    bleGapAddr.addr_type = addr->type;
    memcpy(bleGapAddr.addr, addr->addr, BLE_GAP_ADDR_LENGTH);
    errCode = sd_ble_gap_addr_set(&bleGapAddr);
    break;
  case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
    //default
    break;
  case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
  case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
    privacy.privacy_mode = BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY;
    privacy.private_addr_type = addr->type;
    privacy.private_addr_cycle_s = 900; //sec
    privacy.p_device_irk = NULL;
    errCode = sd_ble_gap_privacy_set(&privacy);
    break;
  default:
    return -EINVAL;
  }
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

static
int getName(BLE_GapName *name)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;

  if(name == NULL) {
    return -EINVAL;
  }
  errCode = sd_ble_gap_device_name_get(name->name, &name->size);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

static
int setName(BLE_GapName *name)
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;

  if(name == NULL) {
    return -EINVAL;
  }
  ble_gap_conn_sec_mode_t secMode = {0};
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode);
  errCode = sd_ble_gap_device_name_set(&secMode, name->name, name->size);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}

static
int setCustomBaseuuid(uint8_t uuid[])
{
  int errCode = BLE_SUCCESS, ret = BLE_SUCCESS;
  ble_uuid128_t *sdsBaseuuid = (ble_uuid128_t *)uuid;
  uint8_t uuidType;

  if(uuid == NULL) {
    return -EINVAL;
  }
  BLE_PRT("sd_ble_uuid_vs_add\n");
  errCode = sd_ble_uuid_vs_add(sdsBaseuuid, &uuidType);
  ret = bleConvertErrorCode((uint32_t)errCode);
  return ret;
}
